11/data/attachments/4157cc94f8f0f07a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_6310af62-d6e4-44d9-a679-27c89ebc0199</nif:username>
            <nif:friendToBeAdded>Joshua_owner_Actions_55802_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>